emacs.org
#+title: Peter's EMACS Configuration

#+PROPERTY: header-args:emacs-lisp :tangle ./emacs.el

* straight.el Setup

straight.el is a package manager for emacs that is

 - compatible with use-package,
 - allows to pin down the version of each package it installs, and
 - downloads the source code of each package it installs and compiles it.


 The following code snippet downloads and installs straight.el. In case this does not work one can clone the straight.el repo from github into ~/.emacs.d/straight/repos.

#+begin_src emacs-lisp

  (defvar bootstrap-version)
  (let ((bootstrap-file
         (expand-file-name
  	"straight/repos/straight.el/bootstrap.el"
  	(or (bound-and-true-p straight-base-dir)
  	    user-emacs-directory)))
        (bootstrap-version 7))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
  	(url-retrieve-synchronously
  	 "https://radian-software.github.io/straight.el/install.el"
  	 'silent 'inhibit-cookies)
        (goto-char (point-max))
        (eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))

  (straight-use-package 'use-package)

#+end_src

* Basic UI configuration

** Basics

#+begin_src emacs-lisp

(setq inhibit-startup-message t)

(scroll-bar-mode -1)        ; Disable visible scrollbar
(tool-bar-mode -1)          ; Disable the toolbar
(tooltip-mode -1)           ; Disable tooltips
(set-fringe-mode 10)        ; Give some breathing room

(menu-bar-mode -1)          ; Disable the menu bar

#+end_src

** Font Setup

Currently I am using /JetBrains Mono/ and /Source Serif 4/ fonts. These fonts are located in the fonts subfolder in case you are on windows and did not install them. Otherwise the nix flake will install them automatically once you include the
additional-emacs-packages in you packages.

The mixed pitch package tries to set variable-pitch-fonts for where it is appropriate. 

#+begin_src emacs-lisp

  (defvar pl/default-font-size 140)
  (defvar pl/default-font "JetBrains Mono")
  (defvar pl/variable-pitch-font "Source Serif 4")
  (defvar pl/variable-pitch-font-size 140)
  (defvar pl/fixed-pitch-font "JetBrains Mono")
  (defvar pl/fixed-pitch-font-size 140)

  (message "Setting faces!")

  (when (member pl/default-font (font-family-list))
    (set-face-attribute 'default nil
  		      :font pl/default-font
  		      :height pl/default-font-size))

  (use-package mixed-pitch
    :straight t
    :config
    (when (member pl/variable-pitch-font (font-family-list))
      (set-face-attribute 'variable-pitch nil
  			:family pl/variable-pitch-font
  			:height pl/variable-pitch-font-size)))

  (when (member pl/fixed-pitch-font (font-family-list))
    (set-face-attribute 'fixed-pitch nil
  		      :font pl/fixed-pitch-font
  		      :height pl/fixed-pitch-font-size))

#+end_src

** Setup transparency

Working in a slightly transparent frame is neet! So let's configure it. Unfortunately, it does work a little different on windows, since the variable alpha-background is not supported there. 

#+begin_src emacs-lisp

  (defun pl/set-transparency ()
  "Set the transparency according to the platform."
  (cond
   ((eq system-type 'windows-nt)
    (set-frame-parameter (selected-frame) 'alpha '(95 . 100))
    (add-to-list 'default-frame-alist '(alpha . (95 . 100)))
    (message "Running on Windows"))
   ((eq system-type 'gnu/linux)
    (set-frame-parameter nil 'alpha-background 95)
    (add-to-list 'default-frame-alist '(alpha-background . 95))
    (message "Running on GNU/Linux"))
   (t
    (message "Unknown operating system"))))

#+end_src

** Putting things together

We have to make sure that a frame is set up when we are in running in a daemon.

#+begin_src emacs-lisp

  (defun pl/setup-gui ()
    "Setup the gui."
    (pl/set-transparency))

  (if (daemonp)
      (add-hook 'after-make-frame-functions
  	      (lambda (frame)
  		;; (setq doom-modeline-icon t)
  		(with-selected-frame frame
  		  (pl/setup-gui)
  		  )))
    (pl/setup-gui))

#+end_src

* Advanced UI configuration

I use /doom-modeline/ and /doom-themes/ since these two are nicely integrated and the colors match a wide a range of needs and packages.

In addition I load the /all-the-icons/ and /nerd-icons/ to have them as well.

#+begin_src emacs-lisp
  
  (use-package all-the-icons
    :straight t
    :if (display-graphic-p))

  (use-package nerd-icons
    :straight t)

  (use-package doom-modeline
    :straight t
    :after all-the-icons nerd-icons
    :init (doom-modeline-mode 1))

  (use-package doom-themes
    :straight t
    :custom
    (doom-themes-enabe bold t)    ; if nil, bold is universally disabled
    (doom-themes enable-italic t) ; if nil, italics are universally disabled

    ;; use "doom-atom" for less minimal icon theme
    (doom-themes-treemacs-theme "doom-atom")

    :config
    (load-theme 'doom-one t)

    ;; Enable flashing mode-line on errors
    (doom-themes-visual-bell-config)
    
    ;; Enable custom neotree theme (nerd-icons must be installed)
    (doom-themes-neotree-config)
    
    ;; Corrects (and improves) org-mode's native fontification
    (doom-themes-org-config))

#+end_src

* Utilities

** Rainbow delimiters

For easier judgement what parans are matching when programmin, especially usefull for lisp.

#+begin_src emacs-lisp

  (use-package rainbow-delimiters
    :straight t
    :hook (prog-mode . rainbow-delimiters-mode))

#+end_src

** Paredit

Automatize paran management

#+begin_src emacs-lisp
  (use-package paredit
    :straight t)

  (autoload 'enable-paredit-mode "paredit" "Turn on pseudo-structural editing of Lisp code." t)
  (add-hook 'emacs-lisp-mode-hook       #'enable-paredit-mode)
  (add-hook 'eval-expression-minibuffer-setup-hook #'enable-paredit-mode)
  (add-hook 'ielm-mode-hook             #'enable-paredit-mode)
  (add-hook 'lisp-mode-hook             #'enable-paredit-mode)
  (add-hook 'lisp-interaction-mode-hook #'enable-paredit-mode)
  (add-hook 'scheme-mode-hook           #'enable-paredit-mode)
  (add-hook 'c-mode                     #'enable-paredit-mode)
  (add-hook 'rustic-mode                #'enable-paredit-mode)

#+end_src

** WhichKey

Shows all the short-cuts in the mini-buffer

#+begin_src emacs-lisp


  (use-package which-key
    :straight t
    :init (which-key-mode)
    :diminish which-key-mode
    :config
    (setq which-key-idle-delay 1))

#+end_src

** Helpfull

Better help sites for elisp function used by emacs.

#+begin_src emacs-lisp
  (use-package helpful
    :straight t
    :after shortdoc
    :init
    (require 'shortdoc)
    :bind
    ("C-h f" . helpful-callable)
    ("C-h v" . helpful-variable)
    ([remap describe-function] . counsel-describe-function)
    ([remap describe-command] . helpful-command)
    ([remap describe-variable] . counsel-describe-variable)
    ([remap describe-key] . helpful-key))
#+end_src


* Competion System

** Vertico

[[https://github.com/minad/vertico?tab=readme-ov-file][Vertico]] is a lightweight Emacs package that provides a minimal, fast vertical user interface for minibuffer completions, such as M-x, file opening, and buffer switching. It builds directly on Emacs’ built-in completion system, ensuring full compatibility with existing commands while focusing only on display and interaction, not replacing core logic

#+begin_src emacs-lisp
  (use-package vertico
    :straight t
    :custom
    (vertico-scroll-margin 0)
    (vertico-count 20)
    (vertico-resize t)
    (vertico-cycle t)
    :init
    (vertico-mode))

  (use-package savehist
    :straight t
    :init
    (savehist-mode))

  (use-package marginalia
    :straight t
    ;; Bind `marginalia-cycle´ locally in the minibuffer. To make the binding
    ;; availabl in the *Completions* buffer, add it to the
    ;; `completion-list-mode-map`.
    :bind (:map minibuffer-local-map
  	      ("M-A" . marginalia-cycle))

    ;; The :init section is always executed.
    :init

    ;; Marginalia must be activated in the :init section of use-package such
    ;; that the mode gets enabled right away. Note that this forces loading
    ;; the package.
    (marginalia-mode))

  (use-package orderless
    :straight t
    :custom
    ;; Configure custom stype dispatcher (see the Consult wiki)
    ;; (orderless-stype-dispatchers
    ;;    '(+orderless-consult-dispatch orderless-affix-dispatch))
    (completion-styles '(orderless basic))
    (completion-category-overrides '((file (styles partial-completion))))
    (completion-category-defaults nil)
    (completion-pcm-leading-wildcard t))


  (use-package nerd-icons-completion
    :straight t
    :after nerd-icons
    :config
    (nerd-icons-completion-mode)
    (add-hook 'marginalia-mode-hook #'nerd-icons-completion-marginalia-setup))

  (use-package corfu
    :straight t
    ;; Optional customizations
    ;; :custom
    ;; (corfu-cycle t)                ;; Enable cycling for `corfu-next/previous'
    ;; (corfu-quit-at-boundary nil)   ;; Never quit at completion boundary
    ;; (corfu-quit-no-match nil)      ;; Never quit, even if there is no match
    ;; (corfu-preview-current nil)    ;; Disable current candidate preview
    ;; (corfu-preselect 'prompt)      ;; Preselect the prompt
    ;; (corfu-on-exact-match 'insert) ;; Configure handling of exact matches

    ;; Enable Corfu only for certain modes. See also `global-corfu-modes'.
    ;; :hook ((prog-mode . corfu-mode)
    ;;        (shell-mode . corfu-mode)
    ;;        (eshell-mode . corfu-mode))

    :init

    ;; Recommended: Enable Corfu globally.  Recommended since many modes provide
    ;; Capfs and Dabbrev can be used globally (M-/).  See also the customization
    ;; variable `global-corfu-modes' to exclude certain modes.
    (global-corfu-mode)

    ;; Enable optional extension modes:
    ;; (corfu-history-mode)
    ;; (corfu-popupinfo-mode)
    )

  ;; Add extensions
  (use-package cape
    :straight t
    ;; Bind prefix keymap providing all Cape commands under a mnemonic key.
    ;; Press C-c p ? to for help.
    :bind ("C-c p" . cape-prefix-map) ;; Alternative key: M-<tab>, M-p, M-+
    ;; Alternatively bind Cape commands individually.
    ;; :bind (("C-c p d" . cape-dabbrev)
    ;;        ("C-c p h" . cape-history)
    ;;        ("C-c p f" . cape-file)
    ;;        ...)
    :init
    ;; Add to the global default value of `completion-at-point-functions' which is
    ;; used by `completion-at-point'.  The order of the functions matters, the
    ;; first function returning a result wins.  Note that the list of buffer-local
    ;; completion functions takes precedence over the global list.
    (add-hook 'completion-at-point-functions #'cape-dabbrev)
    (add-hook 'completion-at-point-functions #'cape-file)
    (add-hook 'completion-at-point-functions #'cape-elisp-block)
    ;; (add-hook 'completion-at-point-functions #'cape-history)
    ;; ...
  )

  ;; Use Dabbrev with Corfu!
  (use-package dabbrev
    :straight t
    ;; Swap M-/ and C-M-/
    :bind (("M-/" . dabbrev-completion)
           ("C-M-/" . dabbrev-expand))
    :config
    (add-to-list 'dabbrev-ignored-buffer-regexps "\\` ")
    (add-to-list 'dabbrev-ignored-buffer-modes 'authinfo-mode)
    (add-to-list 'dabbrev-ignored-buffer-modes 'doc-view-mode)
    (add-to-list 'dabbrev-ignored-buffer-modes 'pdf-view-mode)
    (add-to-list 'dabbrev-ignored-buffer-modes 'tags-table-mode))

  ;; A few more useful configurations...
  (use-package emacs
    :straight t
    :custom
    ;; Enable context menu. `vertico-multiform-mode´ adds a menu in the minibuf
    ;; to switch display modes.
    (context-menu-mode t)
    ;; Support opening new minibuffers from inside existing minibuffers.
    (enable-recursive-minibuffers t)
    ;; Hide command in M-x which do not work in the current mode.
    ;; Vertico commands are hidden in normal buffers. This setting is useful
    ;; beyond Vertico
    (read-extended-command-predicate #'command-completion-default-include-p)
    ;; Do not allow the cursor in the minibuffer prompt
    (minibuffer-prompt-properties
     '(read-only t cursor-intangible t face minibuffer-prompt))
    
    ;; TAB cycle if there are only few candidates
    ;; (completion-cycle-threshold 3)
    
    ;; Enable indentation+completion using the TAB key.
    ;; `completion-at-point' is often bound to M-TAB.
    (tab-always-indent 'complete)
    
    ;; Emacs 30 and newer: Disable Ispell completion function.
    ;; Try `cape-dict' as an alternative.
    (text-mode-ispell-word-completion nil)
    
    ;; Hide commands in M-x which do not apply to the current mode.  Corfu
    ;; commands are hidden, since they are not used via M-x. This setting is
    ;; useful beyond Corfu.
    (read-extended-command-predicate #'command-completion-default-include-p))


  (use-package consult
    :straight t
    ;; Replace bindings. Lazily loaded by `use-package'.
    :bind ;; C-c bindings in `mode-specific-map'
    ("C-c M-x" . consult-mode-command)
    ("C-c h" . consult-history)
    ("C-c k" . consult-kmacro)
    ("C-c m" . consult-man)
    ("C-c i" . consult-info)
    ([remap Info-search] . consult-info)
    ;; C-x bindings in `ctl-x-map'
    ("C-x M-:" . consult-complex-command) ;; orig. repeat-complex-command
    ("C-x b" . consult-buffer) ;; orig. switch-to-buffer
    ("C-x 4 b" . consult-buffer-other-window) ;; orig. switch-to-buffer-other-window
    ("C-x 5 b" . consult-buffer-other-frame) ;; orig. switch-to-buffer-other-frame
    ("C-x t b" . consult-buffer-other-tab)	;; orig. switch-to-buffer-other-tab
    ("C-x r b" . consult-bookmark)		;; orig. bookmark-jump
    ("C-x p b" . consult-project-buffer) ;; orig. project-switch-to-buffer
    ;; Custom M-# bindings for fast register access
    ("M-#" . consult-register-load)
    ("M-'" . consult-register-store) ;; orig. abbrev-prefix-mark (unrelated)
    ("C-M-#" . consult-register)
    ;; Other custom bindings
    ("M-y" . consult-yank-pop) ;; orig. yank-pop
    ;; M-g bindings in `goto-map'
    ("M-g e" . consult-compile-error)
    ("M-g r" . consult-grep-match)
    ("M-g f" . consult-flymake) ;; Alternative: consult-flycheck
    ("M-g g" . consult-goto-line)	 ;; orig. goto-line
    ("M-g M-g" . consult-goto-line) ;; orig. goto-line
    ("M-g o" . consult-outline) ;; Alternative: consult-org-heading
    ("M-g m" . consult-mark)
    ("M-g k" . consult-global-mark)
    ("M-g i" . consult-imenu)
    ("M-g I" . consult-imenu-multi)
    ;; M-s bindings in `search-map'
    ("M-s d" . consult-find) ;; Alternative: consult-fd
    ("M-s c" . consult-locate)
    ("M-s g" . consult-grep)
    ("M-s G" . consult-git-grep)
    ("M-s r" . consult-ripgrep)
    ("M-s l" . consult-line)
    ("M-s L" . consult-line-multi)
    ("M-s k" . consult-keep-lines)
    ("M-s u" . consult-focus-lines)
    ;; Isearch integration
    ("M-s e" . consult-isearch-history)
    :map isearch-mode-map
    ("M-e" . consult-isearch-history) ;; orig. isearch-edit-string
    ("M-s e" . consult-isearch-history) ;; orig. isearch-edit-string
    ("M-s l" . consult-line) ;; needed by consult-line to detect isearch
    ("M-s L" . consult-line-multi)	;; needed by consult-line to detect isearch
    ;; Minibuffer history
    :map minibuffer-local-map
    ("M-s" . consult-history) ;; orig. next-matching-history-element
    ("M-r" . consult-history) ;; orig. previous-matching-history-element

    ;; The :init configuration is always executed (Not lazy)
    :init

    ;; Tweak the register preview for `consult-register-load',
    ;; `consult-register-store' and the built-in commands.  This improves the
    ;; register formatting, adds thin separator lines, register sorting and hides
    ;; the window mode line.
    (advice-add #'register-preview :override #'consult-register-window)
    (setq register-preview-delay 0.5)

    ;; Use Consult to select xref locations with preview
    (setq xref-show-xrefs-function #'consult-xref
          xref-show-definitions-function #'consult-xref)

    ;; Configure other variables and modes in the :config section,
    ;; after lazily loading the package.
    :config

    ;; Optionally configure preview. The default value
    ;; is 'any, such that any key triggers the preview.
    ;; (setq consult-preview-key 'any)
    ;; (setq consult-preview-key "M-.")
    ;; (setq consult-preview-key '("S-<down>" "S-<up>"))
    ;; For some commands and buffer sources it is useful to configure the
    ;; :preview-key on a per-command basis using the `consult-customize' macro.
    (consult-customize
     consult-theme :preview-key '(:debounce 0.2 any)
     consult-ripgrep consult-git-grep consult-grep consult-man
     consult-bookmark consult-recent-file consult-xref
     consult-source-bookmark consult-source-file-register
     consult-source-recent-file consult-source-project-recent-file
     ;; :preview-key "M-."
     :preview-key '(:debounce 0.4 any))

    ;; Optionally configure the narrowing key.
    ;; Both < and C-+ work reasonably well.
    (setq consult-narrow-key "<") ;; "C-+"

    ;; Optionally make narrowing help available in the minibuffer.
    ;; You may want to use `embark-prefix-help-command' or which-key instead.
    ;; (keymap-set consult-narrow-map (concat consult-narrow-key " ?") #'consult-narrow-help)
    )

  (use-package embark
    :straight t

    :bind
    (("C-." . embark-act)         ;; pick some comfortable binding
     ("C-;" . embark-dwim)        ;; good alternative: M-.
     ("C-h B" . embark-bindings)) ;; alternative for `describe-bindings'

    :init

    ;; Optionally replace the key help with a completing-read interface
    (setq prefix-help-command #'embark-prefix-help-command)

    ;; Show the Embark target at point via Eldoc. You may adjust the
    ;; Eldoc strategy, if you want to see the documentation from
    ;; multiple providers. Beware that using this can be a little
    ;; jarring since the message shown in the minibuffer can be more
    ;; than one line, causing the modeline to move up and down:

    ;; (add-hook 'eldoc-documentation-functions #'embark-eldoc-first-target)
    ;; (setq eldoc-documentation-strategy #'eldoc-documentation-compose-eagerly)

    ;; Add Embark to the mouse context menu. Also enable `context-menu-mode'.
    ;; (context-menu-mode 1)
    ;; (add-hook 'context-menu-functions #'embark-context-menu 100)

    :config

    ;; Hide the mode line of the Embark live/completions buffers
    (add-to-list 'display-buffer-alist
                 '("\\`\\*Embark Collect \\(Live\\|Completions\\)\\*"
                   nil
                   (window-parameters (mode-line-format . none)))))

  ;; Consult users will also want the embark-consult package.
  (use-package embark-consult
    :straight t)
  
#+end_src
